app/controllers/employees_controller.rb

  def index
    @employees = Employee.order(:title)
    @schedules = Schedule.all
---
SELECT "schedules".* FROM "schedules"

  def create
    @employee = Employee.new(employee_params)

    respond_to do |format|
      if @employee.save
---
INSERT INTO "employees" ("created_at", "description", "name", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Wed, 15 Jan 2014 15:41:32 UTC +00:00], ["description", "iusndasnaod"], ["name", "Marvin"], ["title", "manager "], ["updated_at", Wed, 15 Jan 2014 15:41:32 UTC +00:00]]

  def update
    respond_to do |format|
      if @employee.update(employee_params)
---
UPDATE "employees" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "employees"."id" = 2  [["title", ""], ["description", "918 7707917"], ["updated_at", Tue, 21 Jan 2014 13:30:03 UTC +00:00]]