app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    if @post.save
---
INSERT INTO "posts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Sat, 18 Jan 2014 20:12:57 UTC +00:00], ["updated_at", Sat, 18 Jan 2014 20:12:57 UTC +00:00]]