app/controllers/schedules_controller.rb

INSERT INTO "schedules" ("created_at", "day", "shift", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Wed, 15 Jan 2014 20:59:16 UTC +00:00], ["day", "Monday"], ["shift", "AM"], ["updated_at", Wed, 15 Jan 2014 20:59:16 UTC +00:00]]
---
  def create
    @schedule = Schedule.new(schedule_params)

    respond_to do |format|
      if @schedule.save

UPDATE "schedules" SET "day" = ?, "shift" = ?, "updated_at" = ? WHERE "schedules"."id" = 11  [["day", "Friday"], ["shift", "PM"], ["updated_at", Wed, 15 Jan 2014 21:11:52 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @schedule.update(schedule_params)

DELETE FROM "schedules" WHERE "schedules"."id" = ?  [["id", 1]]
---
  def destroy
    @schedule.destroy